app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `fb_user_id`, `email_hash`, `remember_token`, `login`, `email`, `created_at`) VALUES('Top Dog', 'e8bd5db21c0cd150dd66f0aad81711c681487f44', '2009-02-26 12:34:37', 'a4299aba01c79166938d7015594936a69d084c08', NULL, NULL, NULL, NULL, 'topdog', 'stueccles@gmail.com', '2009-02-26 12:34:37')

  def link_user_accounts
debugger
    if self.current_user.nil?
      #register with fb
      User.create_from_fb_connect(facebook_session.user)
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `fb_user_id`, `email_hash`, `remember_token`, `login`, `email`) VALUES('Shantanu Bhardwaj', NULL, '2009-09-17 20:44:22', NULL, NULL, '2009-09-17 20:44:22', 12414065, NULL, NULL, 'facebooker_12414065', '')